app/views/users/show.html.erb

SELECT  1 AS one FROM `microposts` WHERE `microposts`.`user_id` = 1 LIMIT 1
---
		<%= render 'follow_form'  if logged_in? %>
	    <% if @user.microposts.any? %>