app/controllers/microposts_controller.rb

SELECT `microposts`.* FROM `microposts`
---
  def index
    @microposts = Micropost.all

INSERT INTO `microposts` (`name`, `ext`, `size`, `user_id`, `created_at`, `updated_at`, `picture`) VALUES ('deefef', 'dfdfq', 3434, 4, '2017-08-07 21:44:40', '2017-08-07 21:44:40', 'Screenshot_from_2016-09-13_20-41-14.png')
---
  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save

DELETE FROM `microposts` WHERE `microposts`.`id` = 305
---
  def destroy
    @micropost.destroy

SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 1 LIMIT 1
---
    def set_micropost
      @micropost = Micropost.find(params[:id])