app/controllers/static_pages_controller.rb

  def home
  	hostname = Diplomat::Service.get('redis').Address
    port = Diplomat::Service.get('redis').ServicePort
  	redis = Redis.new(host: hostname, port: port, db: 0)
  	@micropost  = current_user.microposts.build if logged_in?
  	if params[:search]
    	@feed_items = current_user.feed_search(params[:search]).paginate(page: params[:page]) if logged_in?
---
SELECT  `microposts`.* FROM `microposts` WHERE (name LIKE '%d%') ORDER BY `microposts`.`created_at` DESC, created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `microposts` WHERE (user_id IN (SELECT followed_id FROM relationships