app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    if logged_in?
      @users = User.paginate(:page => params[:page], :per_page => 30)

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 1 ORDER BY `microposts`.`created_at` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 1
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('Andres Sanchez Alzate', 'karlos_a.s@hotmail.com', '2017-08-02 15:19:16', '2017-08-02 15:19:16', '123456')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def following
    @title = "Following"
    @user  = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def followers
    @title = "Followers"
    @user  = User.find(params[:id])